In [14]:
import numpy as np
import pandas as pd

In [2]:
data=pd.read_csv('../Dataset/zomato.csv')
data.head()

,url,address,name,online_order,book_table,rate,votes,phone,location,rest_type,dish_liked,cuisines,approx_cost(for two people),reviews_list,menu_item,listed_in(type),listed_in(city)
0,https://www.zomato.com/bangalore/jalsa-banasha...,"942, 21st Main Road, 2nd Stage, Banashankari, ...",Jalsa,Yes,Yes,4.1/5,775,080 42297555\r\n+91 9743772233,Banashankari,Casual Dining,"Pasta, Lunch Buffet, Masala Papad, Paneer Laja...","North Indian, Mughlai, Chinese",800,"[('Rated 4.0', 'RATED\n A beautiful place to ...",[],Buffet,Banashankari
1,https://www.zomato.com/bangalore/spice-elephan...,"2nd Floor, 80 Feet Road, Near Big Bazaar, 6th ...",Spice Elephant,Yes,No,4.1/5,787,080 41714161,Banashankari,Casual Dining,"Momos, Lunch Buffet, Chocolate Nirvana, Thai G...","Chinese, North Indian, Thai",800,"[('Rated 4.0', 'RATED\n Had been here for din...",[],Buffet,Banashankari
2,https://www.zomato.com/SanchurroBangalore?cont...,"1112, Next to KIMS Medical College, 17th Cross...",San Churro Cafe,Yes,No,3.8/5,918,+91 9663487993,Banashankari,"Cafe, Casual Dining","Churros, Cannelloni, Minestrone Soup, Hot Choc...","Cafe, Mexican, Italian",800,"[('Rated 3.0', ""RATED\n Ambience is not that ...",[],Buffet,Banashankari
3,https://www.zomato.com/bangalore/addhuri-udupi...,"1st Floor, Annakuteera, 3rd Stage, Banashankar...",Addhuri Udupi Bhojana,No,No,3.7/5,88,+91 9620009302,Banashankari,Quick Bites,Masala Dosa,"South Indian, North Indian",300,"[('Rated 4.0', ""RATED\n Great food and proper...",[],Buffet,Banashankari
4,https://www.zomato.com/bangalore/grand-village...,"10, 3rd Floor, Lakshmi Associates, Gandhi Baza...",Grand Village,No,No,3.8/5,166,+91 8026612447\r\n+91 9901210005,Basavanagudi,Casual Dining,"Panipuri, Gol Gappe","North Indian, Rajasthani",600,"[('Rated 4.0', 'RATED\n Very good restaurant ...",[],Buffet,Banashankari

In [3]:
data.shape
data.columns

Index(['url', 'address', 'name', 'online_order', 'book_table', 'rate', 'votes',
       'phone', 'location', 'rest_type', 'dish_liked', 'cuisines',
       'approx_cost(for two people)', 'reviews_list', 'menu_item',
       'listed_in(type)', 'listed_in(city)'],
      dtype='object')

In [4]:
data.isna().sum()

url                                0
address                            0
name                               0
online_order                       0
book_table                         0
rate                            7775
votes                              0
phone                           1208
location                          21
rest_type                        227
dish_liked                     28078
cuisines                          45
approx_cost(for two people)      346
reviews_list                       0
menu_item                          0
listed_in(type)                    0
listed_in(city)                    0
dtype: int64

In [5]:
data=data.drop(columns=['url','address','name','phone','reviews_list','menu_item','dish_liked','cuisines','listed_in(city)','rest_type'])
data.head()

,online_order,book_table,rate,votes,location,approx_cost(for two people),listed_in(type)
0,Yes,Yes,4.1/5,775,Banashankari,800,Buffet
1,Yes,No,4.1/5,787,Banashankari,800,Buffet
2,Yes,No,3.8/5,918,Banashankari,800,Buffet
3,No,No,3.7/5,88,Banashankari,300,Buffet
4,No,No,3.8/5,166,Basavanagudi,600,Buffet

In [6]:

cat_col=['online_order'	,'book_table','location','listed_in(type)']
num_col=['rate','votes','approx_cost(for two people)']

In [7]:
cat_col_safe=['online_order','book_table','listed_in(type)']
encoded_data=pd.get_dummies(data[cat_col_safe],drop_first=True).astype('int64')
encoded_data

,online_order_Yes,book_table_Yes,listed_in(type)_Cafes,listed_in(type)_Delivery,listed_in(type)_Desserts,listed_in(type)_Dine-out,listed_in(type)_Drinks & nightlife,listed_in(type)_Pubs and bars
0,1,1,0,0,0,0,0,0
1,1,0,0,0,0,0,0,0
2,1,0,0,0,0,0,0,0
3,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...
51712,0,0,0,0,0,0,0,1
51713,0,0,0,0,0,0,0,1
51714,0,0,0,0,0,0,0,1
51715,0,1,0,0,0,0,0,1
51716,0,0,0,0,0,0,0,1

In [8]:
data['location_freq'] = data['location'].map(
    data['location'].value_counts()
)

data=pd.concat((data[num_col],encoded_data,data[['location_freq']]),axis=1)
data.head()

,rate,votes,approx_cost(for two people),online_order_Yes,book_table_Yes,listed_in(type)_Cafes,listed_in(type)_Delivery,listed_in(type)_Desserts,listed_in(type)_Dine-out,listed_in(type)_Drinks & nightlife,listed_in(type)_Pubs and bars,location_freq
0,4.1/5,775,800,1,1,0,0,0,0,0,0,906.0
1,4.1/5,787,800,1,0,0,0,0,0,0,0,906.0
2,3.8/5,918,800,1,0,0,0,0,0,0,0,906.0
3,3.7/5,88,300,0,0,0,0,0,0,0,0,906.0
4,3.8/5,166,600,0,0,0,0,0,0,0,0,684.0

In [9]:
data.dtypes

rate                                   object
votes                                   int64
approx_cost(for two people)            object
online_order_Yes                        int64
book_table_Yes                          int64
listed_in(type)_Cafes                   int64
listed_in(type)_Delivery                int64
listed_in(type)_Desserts                int64
listed_in(type)_Dine-out                int64
listed_in(type)_Drinks & nightlife      int64
listed_in(type)_Pubs and bars           int64
location_freq                         float64
dtype: object

In [10]:
data['rate'].value_counts()

rate
NEW       2208
3.9/5     2098
3.8/5     2022
3.7/5     2011
3.9 /5    1874
          ...
2.2 /5       7
2.0 /5       7
2.0/5        4
1.8 /5       3
1.8/5        2
Name: count, Length: 64, dtype: int64

In [11]:
data['rate']=data['rate'].astype(str)
data=data[~data['rate'].isin(['NEW', '-', 'nan'])]
data['rate']=data['rate'].str.split('/').str[0].astype(float)

In [12]:
data['approx_cost(for two people)'].value_counts()

approx_cost(for two people)
400      5290
300      5270
500      4109
600      3210
200      3173
         ...
120         2
70          1
5,000       1
3,700       1
80          1
Name: count, Length: 63, dtype: int64

In [13]:
data['approx_cost(for two people)'] = (
    data['approx_cost(for two people)']
    .astype(str)
    .str.replace(',', '')
    .astype(float)
)

In [15]:
def standard(X):
    mean=np.mean(X,axis=0)
    std=np.std(X,axis=0)
    std[std==0]=1
    X=(X-mean)/std
    return X

In [ ]:
def